000100200930     A          R ENTETE
000200200930     A                                      SKIPB(1)
000300200930     A                                      SPACEB(1)
000400200930     A                                     2'Programme d''édition :'
000500200930     A            ZPGM          10        23
000600200930     A                                   120'Page :'
000700200930     A            ZPAG           4  0    127
000800200930     A                                      EDTCDE(Z)
000900200930     A                                      SPACEA(1)
001000200930     A                                     2'Demandé le :'
001100200930     A            ZDATE          8  0     15
001200200930     A                                      EDTWRD('  /  /    ')
001300200930     A                                    26'par :'
001400200930     A            ZUSR          10        32
001500200930     A                                      SPACEA(1)
001600200930     A            ZTITRE        30        46
001700200930     A          R COLON
001800200930     A                                      SPACEB(1)
001900200930     A                                     1'Matricule'
002000200930     A                                    12'Nom'
002100200930     A                                    38'Prénom'
002200200930     A                                    64'Adresse'
002300200930     A                                    95'CP'
002400200930     A                                   101'Ville'
002500200930     A          R DETLIG
002600200930     A                                      SPACEB(1)
002700200930     A            ZMATR         10  0      1
002800200930     A                                      EDTCDE(Z)
002900200930     A            ZNOMC         25        12
003000200930     A            ZPRE1C        25        38
003100200930     A            ZADR1C        30        64
003200200930     A            ZCPO           5        95
003300200930     A            ZVILC         30       101
003400200930     A          R DETGEN
003500200930     A                                      SPACEB(1)
003600200930     A                                     3'Matricule'
003700200930     A            ZMATR         10  0     13
003800200930     A                                      EDTCDE(Z)
003900200930     A                                    27'Fonction'
004000200930     A            ZCODF          3        36
004100200930     A            ZLIF          35        40
004200200930     A                                      SPACEA(1)
004300200930     A                                     9'Nom'
004400200930     A            ZNOM          35        13
004500200930     A                                    49'Prénom'
004600200930     A            ZPRE1         35        56
004700200930     A            ZPRE2         35        92
004800200930     A                                      SPACEA(1)
004900200930     A                                     5'Adresse'
005000200930     A            ZAD1          35        13
005100200930     A            ZAD2          35        49
005200200930     A            ZAD3          35        85
005300200930     A                                      SPACEA(1)
005400200930     A                                    10'CP'
005500200930     A            ZCPO           5        13
005600200930     A                                    19'Ville'
005700200930     A            ZVIL          35        25
005800200930     A                                    61'Téléphone'
005900200930     A            ZTEL          20        71
006000200930     A                                    92'Portable'
006100200930     A            ZPOR          20       101
006200200930     A                                      SPACEA(1)
006300200930     A                                    10'Date d''entrée'
006400200930     A            ZDAE           8  0     26
006500200930     A                                      EDTWRD('  /  /    ')
006600200930     A                                    41'Date de départ'
006700200930     A            ZDAS           8  0     57
006800200930     A                                      EDTWRD('  /  /    ')
006900200930     A                                      SPACEA(1)
007000200930     A                                    14'Création le'
007100200930     A            ZDAC           8  0     26
007200200930     A                                      EDTWRD('  /  /    ')
007300200930     A                                    37'à'
007400200930     A            ZHEC           6  0     39
007500200930     A                                      EDTWRD('  :  :  ')
007600200930     A                                    48'par'
007700200930     A            ZUSC          10        52
007800200930     A                                      SPACEA(1)
007900200930     A                                    10'Modification le'
008000200930     A            ZDAM           8  0     26
008100200930     A                                      EDTWRD('  /  /    ')
008200200930     A                                    37'à'
008300200930     A            ZHEM           6  0     39
008400200930     A                                      EDTWRD('  :  :  ')
008500200930     A                                    48'par'
008600200930     A            ZUSM          10        52
008700200930     A                                      SPACEA(1)
008800200930     A          R FIN
008900200930     A                                      SPACEB(1)
009000200930     A                                     2'Nombre total de lignes :'
009100200930     A            ZLIG          10  0     27
009200200930     A                                      EDTCDE(Z)
009300200930     A                                      SPACEA(1)
