000100200930     A*******************************************************
000200200930     A* Fichier du personnel                                *
000300200930     A*                                                     *
000400200930     A*******************************************************
000500200930     A                                      UNIQUE
000600200930     A          R FICF                      PFILE(FIC00P)
000700200930     A                                      FORMAT(FIC00P)
000800200930     A          K FIMAT
