000100200930/* LANCEMENT ÉDITION AVEC PROMPT POUR SAISIR MATRICULE */
000200200930             PGM        PARM(&PMAT)
000300200930             DCL        VAR(&PMAT) TYPE(*CHAR) LEN(10)
000400200930/* ON SOUMET LE JOB AVEC LES ATTRIBUTS USER LE CL FERA LE ROUTAGE */
000500200930             SBMJOB     CMD(CALL PGM(PGMF2SCL) PARM(&PMAT)) +
000600200930                          JOB(EDT_LISP)
000700200930            ENDPGM
