000100200930     A                                      DSPSIZ(24 80 *DS3)
000200200930     A                                      MSGLOC(24)
000300200930     A                                      PRINT
000400200930     A                                      HELP
000500200930     A                                      HLPPNLGRP('XX' XX)
000600200930     A                                      HLPTITLE('Liste fonction')
000700200930     A                                      ALTHELP(CA01)
000800200930     A          R SFL01                     SFL
000900200930     A  08                                  SFLNXTCHG
001000200930     A            ZOPT           1   B  7  3
001100200930     A  12                                  DSPATR(RI PC)
001200200930     A                                      COLOR(WHT)
001300200930     A            ZCOD           3   O  7  6
001400200930     A            ZLIB          30   O  7 11
001500200930     A            ZDAC           8  0O  7 42
001600200930     A                                      EDTWRD('  /  /    ')
001700200930     A            ZDAM           8  0O  7 53
001800200930     A                                      EDTWRD('  /  /    ')
001900200930     A            ZNBEM          6  0O  7 67
002000200930     A                                      EDTCDE(Z)
002100200930     A            HNREC         10  0H
002200200930     A          R FORE1                     SFLCTL(SFL01)
002300200930     A                                      RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
002400200930     A                                      OVERLAY
002500200930     A                                      PUTOVR
002600200930     A N07                                  ROLLUP(02)
002700200930     A                                      CSRLOC(WLIGN  WCOLN)
002800200930     A                                      CHANGE(91)
002900200930     A N04                                  ERASE(SFL01)
003000200930     A  04                                  SFLDSP
003100200930     A  05                                  SFLDSPCTL
003200200930     A  06                                  SFLCLR
003300200930     A  07                                  SFLEND
003400200930     A                                      SFLSIZ(16)
003500200930     A                                      SFLPAG(15)
003600200930     A                                      SFLCSRRRN(&WRACSR)
003700200930     A            WRACSR         5S 0H
003800200930     A            WRAN01         4S 0H      SFLRCDNBR
003900200930     A            ZPGM          10   O  1  2
004000200930     A                                      OVRDTA
004100200930     A                                  1 31'Liste des fonctions'
004200200930     A                                      COLOR(WHT)
004300200930     A            ZUSER         10   O  1 70
004400200930     A                                      OVRDTA
004500200930     A            ZDATE          8  0O  2  2
004600200930     A                                      EDTWRD('  /  /    ')
004700200930     A                                      OVRDTA
004800200930     A            ZHEUR          6  0O  2 14
004900200930     A                                      EDTWRD('  :  :  ')
005000200930     A                                      OVRDTA
005100200930     A            ZJOB          10   O  2 70
005200200930     A                                      OVRDTA
005300200930     A                                  4  3'Indiquez vos options, puis appuyez-
005400200930     A                                       sur ENTREE.'
005500200930     A                                      COLOR(BLU)
005600200930     A                                  5  3'2=Modifier      3=Copier        4=-
005700200930     A                                      Supprimer    5=Afficher'
005800200930     A                                      COLOR(BLU)
005900200930     A                                  6  2'Opt Code Libellé                  -
006000200930     A                                            Création   Modification  Nb e-
006100200930     A                                      mployés'
006200200930     A                                      COLOR(WHT)
006300200930     A            WLICSR        10A  H
006400200930     A            WZOCSR        10A  H
006500200930     A            WPRCSR         4S 0H
006600200930     A            WLIGN          3S 0H
006700200930     A            WCOLN          3S 0H
006800200930     A          R FORB1
006900200930     A                                      CF03
007000200930     A                                      CF05
007100200930     A                                      CF06
007200200930     A                                      CF12
007300200930     A                                      RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
007400200930     A                                      OVERLAY
007500200930     A                                      PUTOVR
007600200930     A                                      CSRLOC(WLIGN  WCOLN)
007700200930     A                                      CHANGE(91)
007800200930     A                                 23  3'F3=Exit     F5=Réafficher    F6=Cr-
007900200930     A                                      éer      F12=Annuler'
008000200930     A                                      COLOR(BLU)
008100200930     A            WLICSR        10A  H
008200200930     A            WZOCSR        10A  H
008300200930     A            WPRCSR         4S 0H
008400200930     A            WLIGN          3S 0H
008500200930     A            WCOLN          3S 0H
008600200930     A          R WSFMSG                    SFL
008700200930     A                                      SFLMSGRCD(24)
008800200930     A            WMGKEY                    SFLMSGKEY
008900200930     A            WPGMQ                     SFLPGMQ
009000200930     A          R WSFCTL                    SFLCTL(WSFMSG)
009100200930     A                                      SFLSIZ(2)
009200200930     A                                      SFLPAG(1)
009300200930     A                                      OVERLAY
009400200930     A  10                                  SFLINZ
009500200930     A                                      SFLDSP
009600200930     A                                      SFLDSPCTL
009700200930     A  09                                  SFLEND
009800200930     A            WPGMQ                     SFLPGMQ
